porousHemodynamic4HD/internalCarotidArtery/constant/porousZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porousZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    SMP
    {
        coordinateSystem
        {
            e1  (1 0 0);
            e2  (0 1 0);
        }
        Darcy
        {
            d   d [0 -2 0 0 0 0 0] (1e6 1e6 1e6);
            f   f [0 -1 0 0 0 0 0] (1e-20 1e-20 1e-20);
        }
    }
)

// ************************************************************************* //
