porousHemodynamic4HD/internalCarotidArtery/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
//------------------------------- hemodynamic4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//----------------------------------------------------------------------------------------//

transportModel			HerschelBulkley;

nu				nu [0 2 -1 0 0 0 0] 3.02e-06;
rho				rho [1 -3 0 0 0 0 0] 1060;
TActive				TActive [0 0 0 0 0 0 0] 1;
CActive				CActive [0 0 0 0 0 0 0] 1;
k				k [1 1 -3 -1 0 0 0] 0.45;
Cp				Cp [0 2 -2 -1 0 0 0] 3770;
Prt				Prt [0 0 0 0 0 0 0] 0.85;
dp				dp [0 1 0 0 0 0 0] 100e-9;
kp				kp [1 1 -3 -1 0 0 0] 20e5;


HerschelBulkleyCoeffs
{
    nu0				nu0 [0 2 -1 0 0 0 0] 3.02e-06;
    tau0			tau0 [0 2 -2 0 0 0 0] 1.65e-5;
    k				k [0 2 -1 0 0 0 0] 8.46e-6;
    n				n [ 0 0  0 0 0 0 0 ] 0.8601;
}

// ************************************************************************* //
