porousHemodynamic4HD/internalCarotidArtery/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0.0;

boundaryField
{
    consoleFluid
    {
	type		BuongiornoBC4HD;
        massFlux        0.0;
        ho              0.0;
        Co              0.0;
    }

    inletFluid
    {
	type		fixedValue;
	value		uniform 0.01;
    }

    outlet1Fluid
    {
	type		zeroGradient;
    }

    outlet2Fluid
    {
	type		zeroGradient;
    }

    outlet3Fluid
    {
	type		zeroGradient;
    }

}
// ************************************************************************* //
