porousHemodynamic4HD/internalCarotidArtery/0/H
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.3;

boundaryField
{
    consoleFluid
    {
        type            slip;
    }

    inletFluid
    {
        type            fixedValue;
        value           uniform 0.3;
    }

    outlet1Fluid
    {
        type            inletOutlet;
        inletValue      uniform 0.3;
        value           uniform 0.3;
    }

    outlet2Fluid
    {
        type            inletOutlet;
        inletValue      uniform 0.3;
        value           uniform 0.3;
    }

    outlet3Fluid
    {
        type            inletOutlet;
        inletValue      uniform 0.3;
        value           uniform 0.3;
    }
}


// ************************************************************************* //
